[
  {
    "title": "Sheepbridge Business Centre",
    "slug": "sheepbridge",
    "small_description": "A digital agency I run as a side business. All the work complete is that of my own.",
    "tags": ["NextJS", "TailwindCSS"],
    "image": "https://utfs.io/f/f36d71a7-93b1-41f7-9a0a-59ae9a1fba1c-q9ux6o.jpg",
    "image_alt": "This is the image alt",
    "live_href": "http://www.sheepbridgebusinesscentre.co.uk",
    "github_href": ""
  },
  {
    "title": "The Wonky Labrador",
    "slug": "wonkylabrador",
    "small_description": "A digital agency I run as a side business. All the work complete is that of my own.",
    "tags": ["NextJS", "TailwindCSS"],
    "image": "https://utfs.io/f/82e1e257-9dec-4254-b3be-524a9b0b28bb-zc2cls.jpg",
    "image_alt": "This is the image alt",
    "live_href": "https://www.thewonkylabrador.co.uk",
    "github_href": ""
  },
  {
    "title": "Blubutton Digital",
    "slug": "blubuttondigital",
    "small_description": "A digital agency I run as a side business. All the work complete is that of my own.",
    "tags": ["NextJS", "TailwindCSS"],
    "image": "https://utfs.io/f/8afd3473-a622-4342-b98a-78227dcb9958-b17oa1.png",
    "image_alt": "This is the image alt",
    "live_href": "https://blubuttondigital.co.uk",
    "github_href": ""
  },
  {
    "title": "Volleyscore",
    "slug": "volleyscore",
    "small_description": "A simple solution to scoring your friendly volleyball games.",
    "tags": ["NextJS", "TailwindCSS", "Zustand"],
    "image": "https://utfs.io/f/1bb84cf2-dfbf-4d2c-b469-5598d4eb6f31-17ktnp.png",
    "image_alt": "This is the alt",
    "live_href": "https://www.volleyscore.co.uk/",
    "github_href": "",
    "markdown_path": "content/volleyscore.mdx",
    "markdown": "## Volleyscore Project\n\n### Overview\n\n**Volleyscore** is a simpl but e yet effective scoreboard app designed to track volleyball matches effortlessly. As a volleyball coach, I recognized the need for a reliable and user-friendly scoring tool during practice matches and club tournaments. This app was developed to streamline the scoring process, ensuring accuracy and ease of use for referees and scorekeepers.\n\n### Motivation\n\nDuring practice matches and tournaments, the team off the court is responsible for refereeing and keeping score. Traditionally, one person referees while another counts the scores manually, often leading to confusion and errors. Volleyscore was created to address this issue by providing a digital solution that simplifies the scoring process and enhances accuracy.\n\n### Features\n\n- **Timeout Timer:** Automatically starts a 30-second timer when a team calls a timeout, ensuring adherence to official rules.\n- **Action History:** Displays a history of all actions taken during the match, allowing users to track points runs and undo actions if needed.\n- **Serving Indicator:** Shows which team is currently serving, even when points are undone, maintaining accurate serve tracking.\n\n### Technology Stack\n\n- **Next.js:** Utilized for server-side rendering and building a fast, scalable app.\n- **Tailwind CSS:** Used for designing a responsive and modern user interface.\n\n### Development Process\n\nDeveloping Volleyscore involved carefully planning the app's logic, particularly the scoring mechanism. Storing and manipulating data to handle actions like undoing scores and updating the scoreline presented challenges. By focusing on robust data management, I ensured the app could handle various scoring scenarios seamlessly.\n\n### Future Enhancements\n\n- **Player Lineups:** Displaying which player is next to serve, their current rotation, and facilitating substitutions.\n- **Comprehensive Match Tracking:** Including match details like location and times, tracking infringements, and other official scoresheet elements.\n- **Live Match Data Streaming:** Allowing users to share links for live match updates and providing referees with real-time score and player rotation information.\n\n### Impact and Feedback\n\nVolleyscore has been well-received by local teams, making the scoring process more efficient and less prone to errors. The app has garnered positive feedback for its user-friendly design and helpful features, encouraging me to continue improving and expanding its capabilities.\n\nFeel free to explore Volleyscore and see how it can simplify scoring for your volleyball matches. For more information or to discuss potential collaborations, please contact me at [your email] or connect with me on [LinkedIn](your LinkedIn profile)."
  }
]
